common/models/custom/Order.php

    public static function findNew() {
        return static::find()
                        ->where(['new' => true])
                        ->orderBy(['updated' => SORT_DESC])
                        ->all();
---
SELECT * FROM `order` WHERE `new`=TRUE ORDER BY `updated` DESC